Autodesk.Revit.DB.Floor.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.Line,System.Double)
Creates a new instance of floor within the project.
Remarks:
To validate curve loop profile use Autodesk.Revit.DB.BoundaryValidation.
To get default floor type use Autodesk.Revit.DB.Floor.GetDefaultFloorType(Autodesk.Revit.DB.Document,System.Boolean).
document:
The document in which the new floor is created.
profile:
An array of planar curve loops that represent the profile of the floor.
floorTypeId:
Id of the floor type to be used by the new Floor.
levelId:
Id of the level on which the floor is to be placed.
isStructural:
True if new floor should be structural, false if architectural.
slopeArrow:
A line used to control the slope angle of the Floor. It must be horizontal.
If slopeArrow is null, the horizontal floor will be created.
slope:
The slope angle. If slopeArrow is null, this parameter will be ignored.
Returns:
If successful a new floor object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId is not a Level.
-or-
The floorTypeId does not correspond to a FloorType.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The slopeArrow must be horizontal or null.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022